/**
  ******************************************************************************
  * 实验平台： XH-STM32F103C8最小核心板 
  * 开发团队： 基穆道山实验室
  * 编写软件： Keil V4.54
  * 编写日期： 2015-07                                           
  ******************************************************************************
  */   
	
#ifndef __LED_H
#define	__LED_H
#include "stm32f10x.h"

/*************** 管脚定义 ***************/
#define LED 	 GPIO_Pin_13	//LED灯与GPIOC_Pin13连接


/*************** 函数声明 ***************/
void LED_Init(void);			  //LED灯初始化函数声明
void LED_NUM_Init(void);
#endif /* __LED_H */

/************************基*穆*道*山*实*验*室********************************/


